# IEntryPoint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IEntryPoint Methods
IEntryPoint Interface See Also
---
The IEntryPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FinishInitialization |
| Initialize |
| OnShutdown |

# See Also
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace